# DataFrames

In [1]:
import pandas as pd

In [9]:
dictionary = {
                "student":["Asad", "Farjad", "Ali","Nasir"]
             ,  "Roll":   ['12','13','14','15']
             ,  "Course": ["DA","DS","Python","Pandas"]
             ,  "Ages":   [23,34,45,21]
             ,  "Marks":  [90,89,78,65]
        }

In [10]:
data = pd.DataFrame(dictionary)

In [11]:
data

  student Roll  Course  Ages  Marks
0    Asad   12      DA    23     90
1  Farjad   13      DS    34     89
2     Ali   14  Python    45     78
3   Nasir   15  Pandas    21     65

In [12]:
data.shape

(4, 5)

In [13]:
data.describe()

            Ages      Marks
count   4.000000   4.000000
mean   30.750000  80.500000
std    11.086779  11.676187
min    21.000000  65.000000
25%    22.500000  74.750000
50%    28.500000  83.500000
75%    36.750000  89.250000
max    45.000000  90.000000

In [14]:
data.columns

Index(['student', 'Roll', 'Course', 'Ages', 'Marks'], dtype='object')

In [17]:
data.head(2)

  student Roll Course  Ages  Marks
0    Asad   12     DA    23     90
1  Farjad   13     DS    34     89

In [18]:
data.tail(2)

  student Roll  Course  Ages  Marks
2     Ali   14  Python    45     78
3   Nasir   15  Pandas    21     65

In [19]:
data.isnull()

   student   Roll  Course   Ages  Marks
0    False  False   False  False  False
1    False  False   False  False  False
2    False  False   False  False  False
3    False  False   False  False  False

In [20]:
data.notnull()

   student  Roll  Course  Ages  Marks
0     True  True    True  True   True
1     True  True    True  True   True
2     True  True    True  True   True
3     True  True    True  True   True

In [21]:
data['student']

0      Asad
1    Farjad
2       Ali
3     Nasir
Name: student, dtype: object

In [23]:
data[['student', 'Ages']]

  student  Ages
0    Asad    23
1  Farjad    34
2     Ali    45
3   Nasir    21

In [24]:
data

  student Roll  Course  Ages  Marks
0    Asad   12      DA    23     90
1  Farjad   13      DS    34     89
2     Ali   14  Python    45     78
3   Nasir   15  Pandas    21     65

In [25]:
data['Grades']=['A','B','C','D']

In [26]:
data

  student Roll  Course  Ages  Marks Grades
0    Asad   12      DA    23     90      A
1  Farjad   13      DS    34     89      B
2     Ali   14  Python    45     78      C
3   Nasir   15  Pandas    21     65      D

In [27]:
del data['Grades']

In [28]:
data

  student Roll  Course  Ages  Marks
0    Asad   12      DA    23     90
1  Farjad   13      DS    34     89
2     Ali   14  Python    45     78
3   Nasir   15  Pandas    21     65

In [29]:
def fn_grade(x):
    grade=None
    if x >=90:
        grade = "A+"
    elif x >=80:
        grade = "A"
    elif x >=70:
        grade = "B"
    elif x >=60:
        grade = "C"
    else:
        grade = "D"
    return grade

In [30]:
data['Grades'] = data['Marks'].apply(fn_grade)

In [31]:
data

  student Roll  Course  Ages  Marks Grades
0    Asad   12      DA    23     90     A+
1  Farjad   13      DS    34     89      A
2     Ali   14  Python    45     78      B
3   Nasir   15  Pandas    21     65      C

# Apply function morethan one columns

In [32]:
df = pd.DataFrame({
    "s1":[90,20,30],
    "s2":[80,23,45]
})
df

   s1  s2
0  90  80
1  20  23
2  30  45

In [46]:
def fn_grade(subject1, subject2):
    obtained = subject1 + subject2
    total = 200
    percentage = obtained / total * 100
    return percentage

fn_grade(90,70)

80.0

In [49]:
df['percentage'] = df[["s1","s2"]].apply(lambda x:fn_grade(x[0],x[1]), axis=1)
df

   s1  s2  percentage
0  90  80        85.0
1  20  23        21.5
2  30  45        37.5

In [41]:
df['percentage'] = df[["s1","s2"]].apply(lambda x:fn_grade(*x), axis=1)
df

   s1  s2  percentage
0  90  80        85.0
1  20  23        21.5
2  30  45        37.5

In [50]:
df1 = pd.DataFrame({
    'phy':[90,85,70],
    'che':[95,82,60],
    'bio':[93,87,34],
    'Isl':[99,81,90],
    'pak':[20,82,92]
})
df1

   phy  che  bio  Isl  pak
0   90   95   93   99   20
1   85   82   87   81   82
2   70   60   34   90   92

In [56]:
def fn_grade1(x):
    print(x)
    obtained = sum(x)
    print(obtained)
    percentage = obtained / 500 * 100
    print(percentage)
    
df1[['phy','che','bio','Isl','pak']].apply(fn_grade1, axis=1)

phy    90
che    95
bio    93
Isl    99
pak    20
Name: 0, dtype: int64
397
79.4
phy    85
che    82
bio    87
Isl    81
pak    82
Name: 1, dtype: int64
417
83.39999999999999
phy    70
che    60
bio    34
Isl    90
pak    92
Name: 2, dtype: int64
346
69.19999999999999

0    None
1    None
2    None
dtype: object

In [76]:
def fn_grade1(x):
    obtained = sum(x) # sum all values
    percentage = obtained / 500 * 100 # calculate percentage
    # start grading logic
    grade=None
    if percentage >=90:
        grade = "A+"
    elif percentage >=80:
        grade = "A"
    elif percentage >=70:
        grade = "B"
    elif percentage >=60:
        grade = "C"
    else:
        grade = "D"
    return obtained,percentage,grade
    
df1["Obtained"], df1["Percentage"],df1["Grade"] = zip(*df1[['phy','che','bio','Isl','pak']].apply(fn_grade1, axis=1))
df1

   phy  che  bio  Isl  pak  Percentage Grade  Obtained
0   90   95   93   99   20        79.4     B       397
1   85   82   87   81   82        83.4     A       417
2   70   60   34   90   92        69.2     C       346

In [84]:
df1[["Obtained","Percentage","Grade"]] = df1[['phy','che','bio','Isl','pak']].apply(fn_grade1, axis=1, result_type="expand")
df1

   phy  che  bio  Isl  pak  Percentage Grade  Obtained
0   90   95   93   99   20        79.4     B       397
1   85   82   87   81   82        83.4     A       417
2   70   60   34   90   92        69.2     C       346

In [70]:
# df1['Grade'] = df1[['phy','che','bio','Isl','pak']].apply(fn_grade1, axis=1)
df1['Percentage'] = df1[['phy','che','bio','Isl','pak']].apply(fn_grade1, axis=1)
df1

   phy  che  bio  Isl  pak Grade Percentage
0   90   95   93   99   20     B          B
1   85   82   87   81   82     A          A
2   70   60   34   90   92     C          C

In [71]:
del df1["Grade"]

In [72]:
del df1["Percentage"]

In [77]:
a=[1,2,3,4,5]
b=["Asad",'Ali', 'Kami','Ahmed', 'nasir']

In [80]:
a = list(zip(a,b))

In [82]:
list(zip(*a))

[(1, 2, 3, 4, 5), ('Asad', 'Ali', 'Kami', 'Ahmed', 'nasir')]